[
  {
    "id": 1,
    "slug": "my-first-portfolio",
    "title": "How I Built My First Fully Functional Portfolio Website for a Hairdresser",
    "date": "19 Sep, 2024",
    "shortContent": "Sharing my experience building a fully functional portfolio website for a hairdresser, covering requirements gathering, design, and backend implementation. This project allowed me to apply skills in React, CSS modules, responsive design, and Node.js.",
    "content": [
      {
        "sectionTitle": "Introduction",
        "text": "In this blog post, I'd like to share my experience of building a fully functional portfolio website for a hairdresser. This process involved several stages, from gathering requirements to implementing the backend. It was both a technical challenge and an opportunity to apply my skills in React, CSS modules, responsive design, and Node.js."
      },
      {
        "sectionTitle": "1. Gathering Requirements and Planning",
        "text": "The project began with a discussion with my client, Taisiya, a hairdresser, to understand her vision for the website. Key requirements included: A stylish and modern design, pages for services, prices, and contact information, a booking form for clients, and the ability to add client reviews."
      },
      {
        "sectionTitle": "2. Structure and Design",
        "text": "For flexibility and modularity, I chose React as the main frontend framework, and used CSS modules for isolated component styling. The main structure of the site included: Home (Welcome text and key services), About Us (Taisiya's story, philosophy, and a photo), Services (detailed list of services with prices), Gallery (showcase of work), Contact (booking form and contact details)."
      },
      {
        "sectionTitle": "3. Responsiveness and UX/UI",
        "text": "To create a responsive design, I utilized Flexbox and CSS Grid for easy layout adjustments. Special attention was given to the mobile version, adding a hamburger menu and a two-row layout for gallery filters."
      },
      {
        "sectionTitle": "4. Client Booking Form",
        "text": "The booking form was a key feature for scheduling services. I used the Yup library for validation, with fields for name, phone number, selected service, and time, ensuring proper data input before backend submission."
      },
      {
        "sectionTitle": "5. Backend and Database",
        "text": "For client reviews and bookings, I used Node.js and MongoDB. Form data was sent to the backend, processed, and stored, handling both client bookings and reviews effectively."
      },
      {
        "sectionTitle": "6. Deployment",
        "text": "The final step was deploying the site using Vercel, ensuring integration of the frontend and stable website performance."
      },
      {
        "sectionTitle": "Conclusion",
        "text": "This project provided valuable client experience, improved my technical skills, and deepened my understanding of full-stack development. Future plans include adding Google Calendar integration and user authentication for clients."
      }
    ],
    "imageUrl": "/images/blogs/post-one.jpg"
  },
  {
    "id": 2,
    "slug": "my-journey-in-web-development",
    "title": "My Journey in Web Development: From Beginner to Frontend Developer",
    "date": "1 Oct, 2024",
    "shortContent": "Sharing my journey into web development, from my early steps to where I am today. This field has proven challenging yet fascinating, requiring not only technical skills but continuous learning and growth.",
    "content": [
      {
        "sectionTitle": "Introduction",
        "text": "In this blog, I want to share my journey into the world of web development. Starting as a beginner, I discovered how challenging and fascinating it could be. Web development demands not just technical skills but constant learning and improvement."
      },
      {
        "sectionTitle": "1. First Steps: HTML and CSS",
        "text": "My journey began with HTML and CSS, the foundation of web design. Creating headings, paragraphs, and lists, positioning elements, and understanding layouts was initially challenging but rewarding."
      },
      {
        "sectionTitle": "2. JavaScript: Moving to Interactivity",
        "text": "JavaScript was the next step, where I learned variables, conditions, loops, and DOM manipulation, enabling real-time page updates and interactivity."
      },
      {
        "sectionTitle": "3. Frameworks: React",
        "text": "Discovering React opened up new possibilities. I created components, used JSX, and managed data with states and props, transforming my ability to build interactive and complex UIs."
      },
      {
        "sectionTitle": "4. Tools and Modern Technologies",
        "text": "Exploring tools like Webpack, Babel, ESLint, and Git helped me streamline my workflow and maintain high code quality. CSS frameworks enabled faster, more responsive design."
      },
      {
        "sectionTitle": "5. Working with Backend and Databases",
        "text": "I delved into backend development with Node.js and MongoDB to build basic servers, gaining a better understanding of server-client interactions and data management."
      },
      {
        "sectionTitle": "6. Practice and Projects",
        "text": "Practicing through projects—like a personal website and blog—solidified my skills, providing real-world experience with teamwork and client projects."
      },
      {
        "sectionTitle": "Conclusion",
        "text": "My journey in web development has been both challenging and rewarding, highlighting the importance of continuous learning and practical application."
      }
    ],
    "imageUrl": "/images/blogs/post-two.jpg"
  },
  {
    "id": 3,
    "slug": "practical-project-breakdown-solving-technical-challenges",
    "title": "Practical Project Breakdown: Solving Technical Challenges",
    "date": "18 Oct, 2024",
    "shortContent": "In this post, I'll break down projects I've tackled, highlighting how I approached and solved various technical challenges. These examples showcase effective tools and methods for handling development issues.",
    "content": [
      {
        "sectionTitle": "Introduction",
        "text": "In this post, I'll break down several projects I've worked on and explain how I approached and solved different technical challenges."
      },
      {
        "sectionTitle": "1. Portfolio Website for a Hairdresser",
        "text": "I implemented a responsive menu with React's useRef for a dropdown on mobile, adding debounce logic to handle quick successive clicks for smooth functionality."
      },
      {
        "sectionTitle": "2. Client Booking Form",
        "text": "I used Yup for form validation to enhance user experience by providing instant feedback for errors before form submission."
      },
      {
        "sectionTitle": "3. API Requests",
        "text": "For a gallery page, I implemented data fetching and filtering, enabling users to view categories with the filter method."
      },
      {
        "sectionTitle": "4. Backend Integration",
        "text": "I built a backend with Express and MongoDB for handling bookings and reviews, ensuring asynchronous requests for optimal performance."
      },
      {
        "sectionTitle": "Conclusion",
        "text": "Each project presented unique challenges, solved by breaking problems into parts and applying effective tools. Web development requires continuous learning, and I look forward to future challenges."
      }
    ],
    "imageUrl": "/images/blogs/post-three.jpg"
  }
]
